export const jalaliDateToText = (inputDate: string) => {
  const [date, time] = inputDate.split(" ");
  const [year, month, day] = date.split("/");
  const [hour, minute] = time.split(":");

  return `‌‌${dayMapper.get(parseInt(day))} ${monthMapper.get(
    parseInt(month)
  )} ${year} ساعت ${hour}:${minute}`;
};

export const dayMapper = new Map([
  [1, "یکم"],
  [2, "دوم"],
  [3, "سوم"],
  [4, "چهارم"],
  [5, "پنجم"],
  [6, "ششم"],
  [7, "هفتم"],
  [8, "هشتم"],
  [9, "نهم"],
  [10, "دهم"],
  [11, "یازدهم"],
  [12, "دوازدهم"],
  [13, "سیزدهم"],
  [14, "چهاردهم"],
  [15, "پانزدهم"],
  [16, "شانزدهم"],
  [17, "هفدهم"],
  [18, "هجدهم"],
  [19, "نوزدهم"],
  [20, "بیستم"],
  [21, "بیست و یکم"],
  [22, "بیست و دوم"],
  [23, "بیست و سوم"],
  [24, "بیست و چهارم"],
  [25, "بیست و پنجم"],
  [26, "بیست و ششم"],
  [27, "بیست و هفتم"],
  [28, "بیست و هشتم"],
  [29, "بیست و نهم"],
  [30, "سی ام"],
  [31, "سی و یکم"],
]);
export const monthMapper = new Map([
  [1, "فروردین"],
  [2, "اردیبهشت"],
  [3, "خرداد"],
  [4, "تیر"],
  [5, "مرداد"],
  [6, "شهریور"],
  [7, "مهر"],
  [8, "آبان"],
  [9, "آذر"],
  [10, "دی"],
  [11, "بهمن"],
  [12, "اسفند"],
]);
